cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/versions'

brew 'ffmpeg'
brew 'gifsicle'
brew 'git'
brew 'go'
brew 'graphviz'
brew 'grc'
brew 'htop'
brew 'imagemagick'
brew 'python'
brew 'pyenv'
brew 'rbenv'
brew 'redis'
brew 'shellcheck'
brew 'terminal-notifier'
brew 'the_silver_searcher'
brew 'unrar'
brew 'vim', args: ['override-system-vi']
brew 'wget'
brew 'youtube-dl'
brew 'zsh'

# gnu stuff
brew 'coreutils'
brew 'findutils'
brew 'gnu-tar'
brew 'gnu-sed'
brew 'gawk'
brew 'gnutls'
brew 'gnu-indent'
brew 'gnu-getopt'

# more cli tools
brew 'ack'
brew 'lynx'
brew 'nvm'
brew 'tree'

# web dev stuff
tap 'homebrew/php'
brew 'php56', restart_service: true
brew 'composer'
brew 'dnsmasq', restart_service: true
brew 'mariadb', restart_service: true
brew 'php56-opcache'
brew 'php56-xdebug'

# network tools
brew 'aircrack-ng'
brew 'hydra'
brew 'john'
brew 'nmap'
brew 'socat'
brew 'speedtest_cli'
brew 'sqlmap'

# git
brew 'bfg'

# casks
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'

cask 'appcleaner'
cask 'atom'
cask 'caffeine'
cask 'diffmerge'
cask 'dropbox'
cask 'font-hack'
cask 'google-chrome'
cask 'iterm2-beta'
cask 'slack'
cask 'slate'
cask 'telegram'
cask 'the-unarchiver'
cask 'transmission'
cask 'vlc'

# jeff's additions
cask '1password'
cask 'adium'
cask 'firefox'
cask 'imagealpha'
cask 'imageoptim'
cask 'keyboard-maestro'
cask 'launchbar'
cask 'mailplane'
cask 'nvalt'
cask 'omnifocus'
cask 'path-finder'
cask 'safari-technology-preview'
cask 'sequel-pro'
cask 'textmate'
cask 'tower'
cask 'transmit'
cask 'tunnelbear'

# fonts
cask 'font-source-code-pro'
cask 'font-source-sans-pro'

# https://github.com/sindresorhus/quick-look-plugins
cask 'betterzipql'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'suspicious-package'
cask 'webpquicklook'
